from config import db
from db import add_lexicon

month_dict = {'January-': 'Январь',
              'February-': 'Февраль',
              'March-': 'Март',
              'April-': 'Апрель',
              'June-': 'Июнь',
              'May-': 'Май',
              'July-': 'Июль',
              'August-': 'Август',
              'September-': 'Сентябрь',
              'October-': 'Октябрь',
              'November-': 'Ноябрь',
              'December-': 'Декабрь', }

lexicon_dict = {'bad_package': 'Проблема со сборкой',
                'defect': 'Проблема с товаром',
                'delivery_issue': 'Проблема с доставкой',
                'wb': 'Wildberries',
                'ozon': 'Озон',
                'ym': 'Яндекс.Маркет',
                'sber': 'Сбер',
                'b2b': 'B2B',
                'nan': 'Пусто',
                'sku_number': 'Артикул',
                'fl': 'ФЛ-',
                'ba': 'БА-',
                'ko': 'КО-',
                'digit': '',
                '': ''}

numerical_month_dict = {1: 'Январь',
                        2: 'Февраль',
                        3: 'Март',
                        4: 'Апрель',
                        5: 'Май',
                        6: 'Июнь',
                        7: 'Июль',
                        8: 'Август',
                        9: 'Сентябрь',
                        10: 'Октябрь',
                        11: 'Ноябрь',
                        12: 'Декабрь', }

alpha_month_dict = {'Январь': 1,
                    'Февраль': 2,
                    'Март': 3,
                    'Апрель': 4,
                    'Май': 5,
                    'Июнь': 6,
                    'Июль': 7,
                    'Август': 8,
                    'Сентябрь': 9,
                    'Октябрь': 10,
                    'Ноябрь': 11,
                    'Декабрь': 12}

selector_dict: dict[str, str] = {'По типу проблемы': 'Тип проблемы',
                                 'По маркетам': 'Маркетплейс'}

stat_options: list[str] = ['Общая таблица',
                           'По типу проблемы',
                           'По артикулу',
                           'По группам артикулов']

filter_options: list[str] = ['За все время',
                             'По месяцам',
                             'За год']

columns_list: list[str] = ['sku_number',
                           'marketplace',
                           'date',
                           'type',
                           'comment']

market_buttons: dict[str, str] = {
    'btn_1': 'Wildberries',
    'btn_2': 'Озон',
    'btn_3': 'Яндекс.Маркет',
    'btn_4': 'Сбер',
    'btn_5': 'B2B',
    'cancel': 'Отмена'
}

sku_groups = {
    'Группа артикулов 100-199': [x for x in range(100, 200)],
    'Группа артикулов 200-299': [x for x in range(200, 300)],
    'Группа артикулов 300-399': [x for x in range(300, 400)],
    'Группа артикулов 400-499': [400, 401, 402, 403, 404, 468, 473],
    'Группа артикулов ГЛТ 411-513': [413, 416, 418, 422, 423, 427, 446, 447, 448, 449, 450, 451, 452, 454, 455, 457,
                                     460, 464],
    'Группа артикулов 500-599': [x for x in range(500, 600)],
    'Группа артикулов 600-699': [606, 610],
    'Группа артикулов КА': [660, 'ка-954'],
    'Группа артикулов 700-799': [747, 748, 749],
    'Группа артикулов 800-899': [832, 849, 850, 855, 865],
    'Группа артикулов 900-999': [945, 950, 954, 972, 997, 998],
    'Группа артикулов 1000-1999': [1000, 1017, 1084, 1127, 1244, 1380, 1384, 1386]
}
