month_dict = {'January-': 'Январь',
              'February-': 'Февраль',
              'March-': 'Март',
              'April-': 'Апрель',
              'June-': 'Июнь',
              'May-': 'Май',
              'July-': 'Июль',
              'August-': 'Август',
              'September-': 'Сентябрь',
              'October-': 'Октябрь',
              'November-': 'Ноябрь',
              'December-': 'Декабрь', }

lexicon_dict = {'bad_package': 'Проблема со сборкой',
                'defect': 'Проблема с товаром',
                'wb': 'Wildberries',
                'ozon': 'Озон',
                'ym': 'Яндекс.Маркет',
                'sber': 'Сбер',
                'b2b': 'B2B'}

numerical_month_dict = {1: 'Январь',
                        2: 'Февраль',
                        3: 'Март',
                        4: 'Апрель',
                        5: 'Июнь',
                        6: 'Май',
                        7: 'Июль',
                        8: 'Август',
                        9: 'Сентябрь',
                        10: 'Октябрь',
                        11: 'Ноябрь',
                        12: 'Декабрь', }

selector_dict = {'По типу проблемы': 'Тип проблемы',
                 'По маркетам': 'Маркетплейс'}